package com.itechtopus.sshgenerator.generator;

import java.util.*;

public class StaticBase {
//    public static final String[] streets =
//            ("").split("\n");

      public static final String[] streets =
            ("Абая\n" +
                "Абрикосовая\n" +
                "Айманова\n" +
                "Актюбинская\n" +
                "Алданская\n" +
                "Алматинская\n" +
                "Алмы\n" +
                "Алтайская\n" +
                "Амангельды\n" +
                "Ангарская\n" +
                "Архангельская\n" +
                "Байзакова\n" +
                "Байкальская\n" +
                "Баймульдина\n" +
                "Бакинская\n" +
                "Баратбаева\n" +
                "Барнаульская\n" +
                "Баянаульская\n" +
                "Бекхожина\n" +
                "Береговая\n" +
                "Бестужева\n" +
                "Бийская\n" +
                "Валиханова\n" +
                "Васильева\n" +
                "Вилюйская\n" +
                "Володарского\n" +
                "Ворушина\n" +
                "Гагарина\n" +
                "Геринга\n" +
                "Герцена\n" +
                "Гоголя\n" +
                "Горького\n" +
                "Гурьевская\n" +
                "Дальневосточная\n" +
                "Декабристов\n" +
                "Дерибаса\n" +
                "Дерова\n" +
                "Джамбульская\n" +
                "Димитрова\n" +
                "Дистанция Пути\n" +
                "Днепропетровская\n" +
                "Добролюбова П. Лен.\n" +
                "Донентаева Горзел.\n" +
                "Донецкая\n" +
                "Достоевского\n" +
                "Елгина\n" +
                "Ермака\n" +
                "Естая\n" +
                "Жанааул\n" +
                "Жаяу Мусы\n" +
                "Железнодорожная\n" +
                "Запорожская\n" +
                "Заслонова\n" +
                "Затон\n" +
                "Зыряновская\n" +
                "Иртышская\n" +
                "Иссыкульская\n" +
                "Каирбаева\n" +
                "Камзина\n" +
                "Камская\n" +
                "Карагандинская\n" +
                "Катаева\n" +
                "Качирская\n" +
                "Кирова\n" +
                "Кирпичная\n" +
                "Кисловодская\n" +
                "Кленовая\n" +
                "Кокчетавская\n" +
                "Комбинатская\n" +
                "Комиссарская\n" +
                "Коммунальная\n" +
                "Комсомольская\n" +
                "Короленко\n" +
                "Космонавтов\n" +
                "Кошевого\n" +
                "Крайняя\n" +
                "Красноярская\n" +
                "Кривенко\n" +
                "Крупской\n" +
                "Кубанская\n" +
                "Кулундинская\n" +
                "Кунавина\n" +
                "Курская\n" +
                "Кустанайская\n" +
                "Кутузова\n" +
                "Ленина\n" +
                "Ленская\n" +
                "Лермонтова\n" +
                "Лесная\n" +
                "Лесопосадочная\n" +
                "Ломова\n" +
                "Луговая\n" +
                "Луначарского\n" +
                "Львовская\n" +
                "Люксембург\n" +
                "Майры\n" +
                "Маркса\n" +
                "Маяковского\n" +
                "Минина\n" +
                "Мира\n" +
                "Молодежная\n" +
                "Молодогвардейцев\n" +
                "Московская\n" +
                "Мостовая\n" +
                "Муткенова\n" +
                "Муялдинская\n" +
                "Набережная\n" +
                "Некрасова\n" +
                "Никитина\n" +
                "Новосибирская\n" +
                "Облепиховая\n" +
                "Обская\n" +
                "Объездная\n" +
                "Одесская\n" +
                "Октябрьская\n" +
                "Омская\n" +
                "Орджоникидзе\n" +
                "Орловская\n" +
                "Осипенко\n" +
                "Павлова\n" +
                "Парковая\n" +
                "Пахомова\n" +
                "Перевалочная Лесоз.\n" +
                "Переулок Пионеров\n" +
                "Площадь Победы\n" +
                "Потанина\n" +
                "Путейская\n" +
                "Пятигорская\n" +
                "Разина\n" +
                "Ракетная\n" +
                "Расковой\n" +
                "Репина\n" +
                "Рижская\n" +
                "Российская\n" +
                "Ростовская\n" +
                "Рыбная\n" +
                "Рылеева\n" +
                "Сахалинская\n" +
                "Северная\n" +
                "Семенченко\n" +
                "Семипалатинская\n" +
                "Сибирская\n" +
                "Смоленская\n" +
                "Совхозная\n" +
                "Сормова\n" +
                "Сталеваров\n" +
                "Степная\n" +
                "Суворова\n" +
                "Сулейменова\n" +
                "Таганрогская\n" +
                "Таллинская\n" +
                "Теплова\n" +
                "Ткачева\n" +
                "Товарная\n" +
                "Толстого\n" +
                "Томская\n" +
                "Торайгырова\n" +
                "Транспортная\n" +
                "Тульская\n" +
                "Украинская\n" +
                "Уральская\n" +
                "Урицкого\n" +
                "Усолка\n" +
                "Усольский Мкр.\n" +
                "Фильтровальная\n" +
                "Фурманова\n" +
                "Хабаровская\n" +
                "Хвойная\n" +
                "Химкомбинатская\n" +
                "Хромзавод\n" +
                "Хромзаводская\n" +
                "Целинная\n" +
                "Циолковского\n" +
                "Чайковского\n" +
                "Чапаева\n" +
                "Челябинская\n" +
                "Черепанова\n" +
                "Чернышевского\n" +
                "Чехова\n" +
                "Чимкентская\n" +
                "Читинская\n" +
                "Чкалова\n" +
                "Шевченко\n" +
                "Щедрина\n" +
                "Экибастузская\n" +
                "Юннатов\n" +
                "Яблоневая\n" +
                "Якутская.").split("\n");

  public static final Map<String, String> transactionMap = new HashMap<>();

  public static final Map<String, String> charmMap = new HashMap<>();

  static {
    charmMap.put("Гипертимный", "Таким людям свойственны общительность, словоохотливость, развитая мимика. Часто легкомысленны и раздражительны, очень инициативны и энергичны.какой бывает характер у человека");
    charmMap.put("Дистимный", "Это замкнутые, пессимистично настроенные люди. Они не любят шумных компаний, чувствуют себя в них некомфортно. Очень ценят своих друзей, имеют обостренное чувство несправедливости. Часто неповоротливы и медлительны в принятии решений.");
    charmMap.put("Циклоидный", "Настроение у этих людей меняется часто, в зависимости от которого они то гиперобщительны, то невероятно замкнуты.");
    charmMap.put("Возбудимый", "Это конфликтные, тяжелые в общении люди. В семье обычно властны, в коллективе неуживчивы. В спокойном состоянии аккуратны и внимательны, а в дурном настроении вспыльчивы, раздражительны.");
    charmMap.put("Застревающий", "Такие люди несговорчивы, любят всех поучать, часто провоцируют конфликты. Предъявляют высокие требования к себе и окружающим.");
    charmMap.put("Педантичный", "Это типичные бюрократы, обнаруживающие чрезмерное внимание к мелочам. Не любят быть лидерами, очень добросовестны, не упускают возможности поворчать.");
    charmMap.put("Тревожный", "Люди с таким характером неуверенны в себе, поэтому не любят конфликтовать, а в случае споров ищут поддержки у других людей. Они дружелюбны и самокритичны, но этот тип характера не такой волевой, поэтому такие люди часто являются предметом шуток и насмешек.");
    charmMap.put("Демонстративный", "Это контактные личности, умеющие приспособиться к любой ситуации, обожают интриги. Часто вызывают раздражение в других своей самоуверенностью, из-за чего случаются конфликты. Артистичны, обходительны, обладают неординарным мышлением, бывают эгоистичны, хвастливы и лицемерны.");
    transactionMap.put("LKUYNHLKJH.W", "Вывод средств в овшоры");
    transactionMap.put("LTHBKJHBDH.W", "Обналичивание посредством ATM");
    transactionMap.put("DSHGFSVAKJ.W", "Погашение овердрафта по счету");
    transactionMap.put("YUT1110CKJ.W", "Перевод peer to peer");
    transactionMap.put("SKUNFWWO23.D", "Перечисление с госбюджета");
    transactionMap.put("AAAFDDVKJG.D", "Заработная плата");
    transactionMap.put("DEPOSOUTAU.D", "Начисление вознаграждения по депозиту");
    transactionMap.put("INCASHING0.D", "Взнос наличными через ATM");
  }


  public static final String[] femaleNames =
      ("Злата\n" +
          "Пелагея\n" +
          "Маргарита\n" +
          "Таисия\n" +
          "Марина\n" +
          "Людмила\n" +
          "Дина\n" +
          "Агния\n" +
          "Альбина\n" +
          "Зоя\n" +
          "Алла\n" +
          "Юлия\n" +
          "Вероника\n" +
          "Инна\n" +
          "Мария\n" +
          "Алина\n" +
          "Рада\n" +
          "Аза\n" +
          "Светлана\n" +
          "Роза\n" +
          "Тамара\n" +
          "Элеонора\n" +
          "Жанна\n" +
          "Оксана\n" +
          "Агафья\n" +
          "Наталия\n" +
          "Евгения\n" +
          "Ярослава\n" +
          "Лада\n" +
          "Любовь\n" +
          "Изабелла\n" +
          "Клара\n" +
          "Анастасия\n" +
          "Мирослава\n" +
          "Ефросиния\n" +
          "Татьяна\n" +
          "Рената\n" +
          "Нона\n" +
          "Эвелина\n" +
          "Анна\n" +
          "Екатерина\n" +
          "Лилия\n" +
          "Наталья\n" +
          "Инга\n" +
          "Варвара\n" +
          "Диана\n" +
          "Вера\n" +
          "Бронислава\n" +
          "Розалия\n" +
          "Ангелина").split("\n");

  public static final String[] femaleSurnames =
      ("Койчева\n" +
          "Ялчевская\n" +
          "Рудникова\n" +
          "Бабанина\n" +
          "Иванкова\n" +
          "Ласкутина\n" +
          "Якубович\n" +
          "Шверник\n" +
          "Добрынина\n" +
          "Брынскиха\n" +
          "Беломестова\n" +
          "Легкодимова\n" +
          "Бысова\n" +
          "Козарь\n" +
          "Ясакова\n" +
          "Веденина\n" +
          "Ельцова\n" +
          "Набатникова\n" +
          "Тимиряева\n" +
          "Дябина\n" +
          "Оскорбина\n" +
          "Унковская\n" +
          "Кузьмова\n" +
          "Шерешевская\n" +
          "Заседателева\n" +
          "Цаплина\n" +
          "Татарова\n" +
          "Мигунова\n" +
          "Доскаль\n" +
          "Иволгина\n" +
          "Матерова\n" +
          "Мирохина\n" +
          "Березина\n" +
          "Челомцева\n" +
          "Карюкина\n" +
          "Шишмарёва\n" +
          "Кулибина\n" +
          "Хлебникова\n" +
          "Бореева\n" +
          "Рощина\n" +
          "Каверина\n" +
          "Лопатина\n" +
          "Ибрагимова\n" +
          "Глинина\n" +
          "Семичаевская\n" +
          "Циолковская\n" +
          "Шадрина\n" +
          "Забирова\n" +
          "Панфилова\n" +
          "Крахмалева").split("\n");

  public static final String[] femalePatronymics =
      ("Степановна\n" +
          "Радионовна\n" +
          "Назаровна\n" +
          "Артеименовна\n" +
          "Ивановна\n" +
          "Тимуровна\n" +
          "Родионовна\n" +
          "Максимильяновна\n" +
          "Филипповна\n" +
          "Гаврииловна\n" +
          "Несторовна\n" +
          "Федотовна\n" +
          "Ефимовна\n" +
          "Мстиславовна\n" +
          "Антоновна\n" +
          "Аркадиевна\n" +
          "Викторовна\n" +
          "Артуровна\n" +
          "Измаиловна\n" +
          "Адамовна\n" +
          "Пахомовна\n" +
          "Владленовна\n" +
          "Афанасиевна\n" +
          "Юрьевна\n" +
          "Никаровна\n" +
          "Всеволодовна\n" +
          "Никитевна\n" +
          "Виссарионовна\n" +
          "Александровна\n" +
          "Святославовна\n" +
          "Ростиславовна\n" +
          "Георгиевна\n" +
          "Аскольдовна\n" +
          "Евграфовна\n" +
          "Андриановна\n" +
          "Германовна\n" +
          "Семеновна\n" +
          "Андрияновна\n" +
          "Емельяновна\n" +
          "Станиславовна\n" +
          "Карповна\n" +
          "Потаповна\n" +
          "Лукьяновна\n" +
          "Кондратьевна\n" +
          "Капитоновна\n" +
          "Леонидовна\n" +
          "Эдуардовна\n" +
          "Игнатьевна\n" +
          "Мартыновна\n" +
          "Фомевна").split("\n");

  public static final String[] malePatronymics =
      ("Гаврилевич\n" +
          "Зиновиевич\n" +
          "Геннадиевич\n" +
          "Дмитриевич\n" +
          "Тихонович\n" +
          "Никитевич\n" +
          "Федосиевич\n" +
          "Аполлинариевич\n" +
          "Фомевич\n" +
          "Никонович\n" +
          "Сидорович\n" +
          "Филиппович\n" +
          "Прохорович\n" +
          "Анатолиевич\n" +
          "Викентиевич\n" +
          "Ульянович\n" +
          "Панкратиевич\n" +
          "Леонтиевич\n" +
          "Михаилович\n" +
          "Назарович\n" +
          "Федотович\n" +
          "Титович\n" +
          "Федорович\n" +
          "Самсонович\n" +
          "Святославович\n" +
          "Григориевич\n" +
          "Эмилевич\n" +
          "Ираклиевич\n" +
          "Ипатиевич\n" +
          "Владимирович\n" +
          "Аникитевич\n" +
          "Егорович\n" +
          "Елизарович\n" +
          "Яковович\n" +
          "Матвеевич\n" +
          "Андреевич\n" +
          "Натанович\n" +
          "Наумович\n" +
          "Казимирович\n" +
          "Несторович\n" +
          "Филимонович\n" +
          "Валериевич\n" +
          "Остапович\n" +
          "Евгениевич\n" +
          "Адрианович\n" +
          "Онуфриевич\n" +
          "Макарович\n" +
          "Сергеевич\n" +
          "Давидович\n" +
          "Всеволодович").split("\n");

  public static final String[] maleNames =
      ("Радислав\n" +
          "Игорь\n" +
          "Данила\n" +
          "Харитон\n" +
          "Аркадий\n" +
          "Владилен\n" +
          "Наум\n" +
          "Сигизмунд\n" +
          "Прохор\n" +
          "Матвей\n" +
          "Аристарх\n" +
          "Мартьян\n" +
          "Ефим\n" +
          "Яков\n" +
          "Эрнест\n" +
          "Авдей\n" +
          "Евдоким\n" +
          "Лука\n" +
          "Зиновий\n" +
          "Антип\n" +
          "Венедикт\n" +
          "Геннадий\n" +
          "Саввелий\n" +
          "Карп\n" +
          "Савелий\n" +
          "Артемий\n" +
          "Максимильян\n" +
          "Мстислав\n" +
          "Клавдий\n" +
          "Казимир\n" +
          "Самуил\n" +
          "Антон\n" +
          "Федор\n" +
          "Макар\n" +
          "Василий\n" +
          "Мартын\n" +
          "Кондратий\n" +
          "Мирон\n" +
          "Радион\n" +
          "Семен\n" +
          "Никанор\n" +
          "Пимен\n" +
          "Владимир\n" +
          "Агафон\n" +
          "Петр\n" +
          "Олег\n" +
          "Афанасий\n" +
          "Севастьян\n" +
          "Марк").split("\n");

  public static final String[] maleSurnames =
      ("Сальков\n" +
          "Хамидуллин\n" +
          "Арданкин\n" +
          "Ковалевский\n" +
          "Русинов\n" +
          "Смольников\n" +
          "Крупин\n" +
          "Кузарин\n" +
          "Тарасов\n" +
          "Живенков\n" +
          "Борев\n" +
          "Кожухов\n" +
          "Угольников\n" +
          "Кинжаев\n" +
          "Арефьев\n" +
          "Благово\n" +
          "Царицын\n" +
          "Щепкин\n" +
          "Успенский\n" +
          "Слепынин\n" +
          "Латушкин\n" +
          "Черников\n" +
          "Сопов\n" +
          "Дворянкин\n" +
          "Кушкин\n" +
          "Максимушкин\n" +
          "Колбенев\n" +
          "Хаслик\n" +
          "Шлиппенбах\n" +
          "Лосев\n" +
          "Ряполов\n" +
          "Гайденко\n" +
          "Емелин\n" +
          "Францев\n" +
          "Квартовский\n" +
          "Безруков\n" +
          "Михалёв\n" +
          "Мамкин\n" +
          "Филатов\n" +
          "Кологреев\n" +
          "Васин\n" +
          "Ягфаров\n" +
          "Крайнев\n" +
          "Арзамасцев\n" +
          "Жеглов\n" +
          "Черкашин\n" +
          "Горбунков\n" +
          "Мирсиянов\n" +
          "Таланов\n" +
          "Кубланов").split("\n");
}


